      SUBROUTINE VF_ZSETR1(AA,VAL,N)

CD=== 概要 ===========================================================

CDT   VF_ZSETR1:実数の1次元配列に一定値を代入する

C==== 宣言 ===========================================================

C     -- 大域型 --
      IMPLICIT INTEGER(I-N),DOUBLE PRECISION(A-H,O-Z)

CD    -- 引数 --
CD    AA(N) : OUT : R*8 : 1次元配列
CD    VAL   : IN  : R*8 : 一定値
CD    N     : IN  : I*4 : 配列AAのサイズ
      DIMENSION AA(N)

C==== 実行 ===========================================================

CD    -- 配列の全要素に代入 --
      DO 100 I=1,N
        AA(I)=VAL
 100  CONTINUE

C     -- 実行文の終了 --
      GOTO 9999

C==== 終了 ===========================================================

 9999 CONTINUE
      RETURN
      END
