      SUBROUTINE VF_ZXMG_WTIME(PT)

CD=== 概要 ===========================================================

CDT   VF_ZXMG_WTIME:MPIマスク/経過時間を得る

C==== 宣言 ===========================================================

C     -- 大域型 --
      IMPLICIT INTEGER(I-N),DOUBLE PRECISION(A-H,O-Z)

C     -- 大域変数 --
      INCLUDE  'mpif.h'

CD    -- 引数 --
CD    PT : OUT : R*8 : 経過時間

C==== 実行 ===========================================================

C     -- MPIルーチン --
      PT=MPI_WTIME()

C     -- 実行文の終了 --
      GOTO 9999

C==== 終了 ===========================================================

 9999 CONTINUE
      RETURN
      END
