      INTEGER,PARAMETER :: NBFRSZ=10
ccc      REAL(8),PARAMETER :: GLIMIT=0.4225
      REAL(8),PARAMETER :: GLIMIT=0.6D0
C
C**********************************************************************
C      NBFRSZ     :  領域接続境界について閉塞を再現しない格子幅を指定
C      GLIMIT     :  閉塞セルにおける面透過率の修正値
C
C       KBLC(NI,NJ) 閉塞フラグ
C                     =   0  :  閉塞なし
C                     =   K  :  閉塞
C                               漂流物底面(接触判定用)が含まれる流体側のセルインデックスK
C**********************************************************************
