      SUBROUTINE VF_CGCPR2(AA,BB,N1,N2)

CD=== 概要 ===========================================================

CDT   VF_CGCPR2:境界値の2次元配列を複写する（移動障害物処理用）

C==== 宣言 ===========================================================

C     -- 大域型 --
      IMPLICIT INTEGER(I-N),DOUBLE PRECISION(A-H,O-Z)

C     -- 大域変数 --
      INCLUDE 'VF_ANUMBI.h'

CD    -- 引数 --
CD    AA(N1,3) : OUT : R*8 : 2次元配列(複写先)
CD    BB(N2,3) : IN  : R*8 : 2次元配列(複写基)
      DIMENSION AA(N1,3),BB(N2,3)

C==== 実行 ===========================================================

CD    -- 配列の全要素に代入 --
      DO 100 L=1,NUMB0
        AA(L,1)=BB(L,1)
        AA(L,2)=BB(L,2)
        AA(L,3)=BB(L,3)
 100  CONTINUE

C     -- 実行文の終了 --
      GOTO 9999

C==== 終了 ===========================================================

 9999 CONTINUE
      RETURN
      END
