      SUBROUTINE VF_CGCPR1(AA,BB,N1,N2)

CD=== 概要 ===========================================================

CDT   VF_CGCPR1:境界値の1次元配列を複写する（移動障害物処理用）

C==== 宣言 ===========================================================

C     -- 大域型 --
      IMPLICIT INTEGER(I-N),DOUBLE PRECISION(A-H,O-Z)

C     -- 大域変数 --
      INCLUDE 'VF_ANUMBI.h'

CD    -- 引数 --
CD    AA(N1) : OUT : R*8 : 1次元配列(複写先)
CD    BB(N2) : IN  : R*8 : 1次元配列(複写基)
      DIMENSION AA(N1),BB(N2)

C==== 実行 ===========================================================

CD    -- 配列の全要素に代入 --
      DO 100 L=1,NUMB0
        AA(L)=BB(L)
 100  CONTINUE

C     -- 実行文の終了 --
      GOTO 9999

C==== 終了 ===========================================================

 9999 CONTINUE
      RETURN
      END
